package h.collection;

public class ListScoreBook {

	public static void main(String[] args) {
		/*
		김범수, 나얼, 박효신, 이수, 신용재, 하현우 총 여섯명의
		국어/수학/영어/과학/코딩 점수를 각 0~100까지의 랜덤 값으로
		입력하고, 학생별 평균을 구하세요.
		(List와 Map을 이용)
		
		================== 원점수 ==================
		학생명	국어	수학	영어	과학	코딩
		김범수	87		68		20		87		87
		나얼	87		51		56		15		87
		박효신	87		68		87		89		77
		이수	87		34		56		47		87
		신용재	57		68		86		87		68
		하현우	87		18		56		87		87
		============================================
		
		===================== 평균점수 =====================
		학생명	국어	수학	영어	과학	코딩	평균
		김범수	87		68		20		87		87		00
		나얼	87		51		56		15		87		00
		박효신	87		68		87		89		77		00
		이수	87		34		56		47		87		00
		신용재	57		68		86		87		68		00
		하현우	87		18		56		87		87		00
		====================================================
		
		 * */

	}

}
